{
  "id": 234,
  "key": "Viego",
  "name": "Viego",
  "title": "The Ruined King",
  "fullName": "",
  "icon": "http://ddragon.leagueoflegends.com/cdn/11.7.1/img/champion/Viego.png",
  "resource": "NONE",
  "attackType": "MELEE",
  "adaptiveType": "PHYSICAL_DAMAGE",
  "stats": {
    "health": {
      "flat": 560,
      "percent": 0.0,
      "perLevel": 95,
      "percentPerLevel": 0.0
    },
    "healthRegen": {
      "flat": 7,
      "percent": 0.0,
      "perLevel": 0.7,
      "percentPerLevel": 0.0
    },
    "mana": {
      "flat": 0,
      "percent": 0.0,
      "perLevel": 0,
      "percentPerLevel": 0.0
    },
    "manaRegen": {
      "flat": 0,
      "percent": 0.0,
      "perLevel": 0,
      "percentPerLevel": 0.0
    },
    "armor": {
      "flat": 34,
      "percent": 0.0,
      "perLevel": 4,
      "percentPerLevel": 0.0
    },
    "magicResistance": {
      "flat": 32,
      "percent": 0.0,
      "perLevel": 1.25,
      "percentPerLevel": 0.0
    },
    "attackDamage": {
      "flat": 57,
      "percent": 0.0,
      "perLevel": 3.5,
      "percentPerLevel": 0.0
    },
    "movespeed": {
      "flat": 345,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "acquisitionRadius": {
      "flat": 775,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "selectionRadius": {
      "flat": 125,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "pathingRadius": {
      "flat": 35,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "gameplayRadius": {
      "flat": 65,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "criticalStrikeDamage": {
      "flat": 200,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "criticalStrikeDamageModifier": {
      "flat": 1.0,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "attackSpeed": {
      "flat": 0.658,
      "percent": 0.0,
      "perLevel": 2.5,
      "percentPerLevel": 0.0
    },
    "attackSpeedRatio": {
      "flat": 0.658,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "attackCastTime": {
      "flat": 0.3,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "attackTotalTime": {
      "flat": 1.6,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "attackDelayOffset": {
      "flat": -0.13553,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "attackRange": {
      "flat": 225,
      "percent": 0.0,
      "perLevel": 0,
      "percentPerLevel": 0.0
    },
    "aramDamageTaken": {
      "flat": 0.95,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "aramDamageDealt": {
      "flat": 1.05,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "aramHealing": {
      "flat": 1.0,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "aramShielding": {
      "flat": 1.0,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "urfDamageTaken": {
      "flat": 0.95,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "urfDamageDealt": {
      "flat": 1.05,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "urfHealing": {
      "flat": 1.0,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    },
    "urfShielding": {
      "flat": 1.0,
      "percent": 0.0,
      "perLevel": 0.0,
      "percentPerLevel": 0.0
    }
  },
  "roles": [
    "ASSASSIN",
    "FIGHTER",
    "SKIRMISHER"
  ],
  "attributeRatings": {
    "damage": 3,
    "toughness": 1,
    "control": 2,
    "mobility": 2,
    "utility": 1,
    "abilityReliance": 20,
    "attack": 0,
    "defense": 0,
    "magic": 0,
    "difficulty": 3
  },
  "abilities": {
    "P": [
      {
        "name": "Sovereign's Domination",
        "icon": "https://cdn.communitydragon.org/latest/champion/Viego/ability-icon/p",
        "effects": [
          {
            "description": "Innate: Whenever an enemy champion is killed by Viego or dies within 3 seconds of being damaged by him, a Mist Wraith spawns from their corpse for 8 seconds. Viego can basic attack a Mist Wraith to possess it, heal himself for 8% (+ 2.5% per 100 bonus AD) (+ 1.5% per 100 AP) (+ 250% bonus attack speed) of the target's maximum health, and blink to its location after winding up for 1 second, during which he is untargetable (except to turrets).",
            "leveling": []
          },
          {
            "description": "Possession lasts for 10 seconds and replaces Viego's basic attacks, basic abilities, items, base stats (based on Viego's level), and appearance with the champion the Mist Wraith was summoned by and grants him a free cast of Heartbreaker that is initially placed on a 1.5-second cooldown. Viego also gains 10% bonus movement speed while moving toward nearby enemy champions during this time.",
            "leveling": []
          },
          {
            "description": "Viego cannot use item actives, consumable items, nor the shop while under possession.",
            "leveling": []
          },
          {
            "description": "Viego will preserve his current health percentage between transformations.",
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": null,
        "targeting": "Passive",
        "affects": null,
        "spellshieldable": null,
        "resource": null,
        "damageType": null,
        "spellEffects": null,
        "projectile": null,
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Viego will copy the possessed champion's ability ranks.\nViego cannot level up their abilities with his available skill points.\nWhile winding up on a Mist Wraith, Viego is unable to move, basic attack, or cast his abilities, but he can still use some item actives and summoner spells.\nThe wind up can only be interrupted by  death.\nMist Wraiths will not expire while Viego is winding up on them.\nThe wind up's  untargetability does not  destroy in-flight  projectiles from  turrets.\nThe possessed champion's abilities do not cost any  mana or  energy even if that specific champion normally uses either as a casting resource.\nAlternative resources, such as  Fury,  Flow, or  Health, will still be utilized.\nThe current cooldowns of Viego's and the possessed champion's abilities will not be reset between transformations. They will continue ticking down in the background.\nThe passive cooldowns of items are shared between Viego's and the possessed champion's.\nOnce possession ends, Viego returns to his normal state and certain effects gained from the possessed champion's abilities will be immediately removed.\nSome buffs will be kept and some buffs will be lost.\nViego will almost always keep  shields and  spell shields.\nPassive effects will be lost by default, as Viego no longer has their abilities.\n Channeled abilities maintained will be interrupted.\nToggled abilities will be automatically toggled off.\nViego retains his own summoner spells, trinket item, and runes during possession.\nViego can possess a Mist Wraith while already under possession. Doing so discards his current possession when the windup completes.\nMist Wraiths will not spawn while Viego is dead.\nSovereign's Domination will not summon a Mist Wraith from  clones.\nThe possession will not expire while Viego is in a  zombie state.\nWhile in a zombie state,  Heartbreaker is disabled.\nThe possession will not end prematurely if Viego enters  resurrection.\nThe possession will acquire the basic abilities of shapeshifting champions (e.g.  Elise's  Spider Form / Human Form,  Jayce's  Transform Mercury Cannon /  Transform Mercury Hammer, and  Nidalee's  Aspect of the Cougar) based on which form they died as.\nMist Wraiths are considered  clones and can only be targeted by Viego.\nIf Viego possesses an enemy champion who owns  Dark Seal or  Mejai's Soulstealer, he will gain their Glory stacks for the possession.\nIf Viego possesses an enemy champion who owns  Cull, killing minions will grant the extra gold. It will however not count towards his  Cull if he owns one.\n 𝐏𝐄𝐍𝐃𝐈𝐍𝐆 𝐅𝐎𝐑 𝐓𝐄𝐒𝐓  Do the stacks remain the same upon possessing the same enemy multiple times or does Viego get the same amount of Cull stacks that the enemy had? Can he get the  +350 extra gold upon completing the Cull?\nIf Viego possesses an enemy champion who owns  Relic Shield,  Steel Shoulderguards,  Spellthief's Edge, or  Spectral Sickle, the gold gained from using any one of the items will also count towards Viego's own Quest.\nIf Viego possesses an enemy champion who owns  Tear of the Goddess, the stacks it has will be transferred to his  Tear of the Goddess if he owns one.",
        "blurb": "Viego can temporarily possess enemy champions he helps kill,  healing for a portion of their  maximum health.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": null,
        "effectRadius": null,
        "targetRange": null
      }
    ],
    "Q": [
      {
        "name": "Blade of the Ruined King",
        "icon": "https://cdn.communitydragon.org/latest/champion/Viego/ability-icon/q",
        "effects": [
          {
            "description": "Passive: Viego's basic attacks deal bonus physical damage on-hit. The bonus damage has a minimum threshold and is capped at 80 against monsters.",
            "leveling": [
              {
                "attribute": "Bonus Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      2,
                      3,
                      4,
                      5,
                      6
                    ],
                    "units": [
                      "% of target's current health",
                      "% of target's current health",
                      "% of target's current health",
                      "% of target's current health",
                      "% of target's current health"
                    ]
                  }
                ]
              },
              {
                "attribute": "Minimum Bonus Damage",
                "modifiers": [
                  {
                    "values": [
                      10,
                      15,
                      20,
                      25,
                      30
                    ],
                    "units": [
                      "",
                      "",
                      "",
                      "",
                      ""
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "Additionally, damaging abilities apply a mark to enemies for 4 seconds. Viego's next basic attack against a marked target consumes the mark to strike twice, with the second strike dealing 20% AD (+ 15% AP) physical damage and healing him for 150% of the post-mitigation damage dealt, increased to 155% against monsters and reduced to 100% against minions. The second strike is affected by critical strike modifiers and applies on-hit effects at 100% effectiveness.",
            "leveling": []
          },
          {
            "description": "Active: Viego thrusts his blade in the target direction, dealing physical damage to enemies hit, increased by 0% − 75% (based on critical strike chance), and 10 bonus physical damage against monsters.",
            "leveling": [
              {
                "attribute": "Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      25,
                      40,
                      55,
                      70,
                      85
                    ],
                    "units": [
                      "",
                      "",
                      "",
                      "",
                      ""
                    ]
                  },
                  {
                    "values": [
                      60,
                      60,
                      60,
                      60,
                      60
                    ],
                    "units": [
                      "% AD",
                      "% AD",
                      "% AD",
                      "% AD",
                      "% AD"
                    ]
                  }
                ]
              },
              {
                "attribute": "Maximum Damage",
                "modifiers": [
                  {
                    "values": [
                      43.75,
                      70,
                      96.25,
                      122.5,
                      148.75
                    ],
                    "units": [
                      "",
                      "",
                      "",
                      "",
                      ""
                    ]
                  },
                  {
                    "values": [
                      105,
                      105,
                      105,
                      105,
                      105
                    ],
                    "units": [
                      "% AD",
                      "% AD",
                      "% AD",
                      "% AD",
                      "% AD"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "Blade of the Ruined King's passive remains under possession, and while transformed, the second strike is instead converted to bonus damage on-hit which no longer applies on-hit effects but is still affected by critical strike modifiers.",
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": {
          "modifiers": [
            {
              "values": [
                5,
                4.5,
                4,
                3.5,
                3
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": true
        },
        "targeting": "Direction",
        "affects": "Self, Enemies",
        "spellshieldable": "true",
        "resource": null,
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "special",
        "projectile": "FALSE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "The mark will not be applied to the primary target struck by  Heartbreaker, but it can triggered from it.\nBlade of the Ruined King's cast time is always 140% of the caster's attack windup time.\nAt base attack speed, Viego's attack windup is 0.25 seconds.\nAn easy formula to calculate the cast time is [ 0.23 seconds divided by total attack speed ].\nReducing Viego's attack speed via  attack speed reductions also increases Blade of the Ruined King's cast time by the same fraction.\nIt is calculated from Viego's total attack speed after cap (2.5) and floor (0.2), making the maximum possible cast time 1.155 seconds.\nBlade of the Ruined King's cast time becomes the same as the standard 0.264 seconds cast time for most abilities at 32.6% bonus attack speed.\nApplies  area damage for the thrust and  proc damage for the bonus damage on-hit and second strike.\nBlade of the Ruined King strikes from Viego's location at the end of the cast time.\nViego will not perform the second strike if the first attack was  dodged,  blocked, and  missed.\nThe second strike rolls  critical strike independently from the triggering attack.\nIf the second strike hits a dead unit, Viego will still  heal based on the post-mitigation damage that he would deal with it.",
        "blurb": "Passive:  Viego's basic attacks deal a percent of the  target's current health as bonus physical damage. When Viego attacks an enemy he recently hit with an ability, the attack strikes twice. The second strike will deal modified physical damage and  heal him.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": "125",
        "angle": null,
        "castTime": "0.35 (at base attack speed)",
        "effectRadius": null,
        "targetRange": "600"
      }
    ],
    "W": [
      {
        "name": "Spectral Maw",
        "icon": "https://cdn.communitydragon.org/latest/champion/Viego/ability-icon/w",
        "effects": [
          {
            "description": "Active: Viego charges while being slowed by 15% for up to 3 seconds to increase Spectral Maw's mist missile range and stun duration over the first second of the channel. Spectral Maw can be recast at any time within its duration.",
            "leveling": []
          },
          {
            "description": "If the charge completes without reactivation, Spectral Maw is canceled and goes on full cooldown.",
            "leveling": []
          },
          {
            "description": "Recast: Viego hurls a blast of mist in the target direction and dashes a fixed distance in the same direction, though not through terrain. The mist deals magic damage to the first enemy struck and stuns them for 0.25 − 1.25 (based on channel time) seconds.",
            "leveling": [
              {
                "attribute": "Magic Damage",
                "modifiers": [
                  {
                    "values": [
                      80,
                      135,
                      190,
                      245,
                      300
                    ],
                    "units": [
                      "",
                      "",
                      "",
                      "",
                      ""
                    ]
                  },
                  {
                    "values": [
                      100,
                      100,
                      100,
                      100,
                      100
                    ],
                    "units": [
                      "% AP",
                      "% AP",
                      "% AP",
                      "% AP",
                      "% AP"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "If the charge is interrupted, Spectral Maw resumes a reduced 3-second static cooldown.",
            "leveling": []
          },
          {
            "description": "Spectral Maw resets Viego's basic attack timer.",
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": {
          "modifiers": [
            {
              "values": [
                8,
                8,
                8,
                8,
                8
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": true
        },
        "targeting": "Auto / Direction",
        "affects": "Self, Enemies",
        "spellshieldable": "true",
        "resource": null,
        "damageType": "MAGIC_DAMAGE",
        "spellEffects": "spell",
        "projectile": "TRUE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "The following table refers for interactions while Viego is  channeling:\n\n\nType\n\nCharge channel\n\n\nAttacking\n\nDisabled\n\n\nAbilities\n\n Harrowed Path is usable.  Blade of the Ruined King and  Heartbreaker are disabled.\n\n\nMovement\n\nAllowed\n\n\nItems\n\nUsable\n\nN/A\n\n\nDisabled\n\nAll items are disabled\n\n\nInterrupted by\n\nN/A\n\n\nConsumables\n\nDisabled, but can still use trinkets.\n\n\nSpells\n\nUsable\n\n Barrier  Clarity  Cleanse  Exhaust  Ghost  Heal  Ignite  Smite  Flash\n\n\nDisabled\n\n Teleport  Recall\n\n\nInterrupted by\n\n Hexflash (Recasts)\n\n\nInterrupted by\n\nDeath Grounding effects Immobilizing effects Cast-inhibiting effects",
        "blurb": "Active:  Viego  charges, then  dashes forward, hurling a blast of mist that collides with the first enemy hit, dealing magic damage and  stunning them. Stun duration and mist range increase with charge time.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": "1000 / 1300",
        "width": "120",
        "angle": null,
        "castTime": "none",
        "effectRadius": null,
        "targetRange": "300 /  500 − 900 (based on channel time)"
      }
    ],
    "E": [
      {
        "name": "Harrowed Path",
        "icon": "https://cdn.communitydragon.org/latest/champion/Viego/ability-icon/e",
        "effects": [
          {
            "description": "Active: Viego sends a spectre in the target direction that creates a trail of mist along its path which lasts 8 seconds. The mist spreads around the first instance of terrain encountered.",
            "leveling": []
          },
          {
            "description": "While inside the mist, Viego gains bonus attack speed and, if he is not attacking or casting, he becomes camouflaged and gains bonus movement speed.",
            "leveling": [
              {
                "attribute": "Bonus Attack Speed",
                "modifiers": [
                  {
                    "values": [
                      30,
                      35,
                      40,
                      45,
                      50
                    ],
                    "units": [
                      "%",
                      "%",
                      "%",
                      "%",
                      "%"
                    ]
                  }
                ]
              },
              {
                "attribute": "Bonus Movement Speed",
                "modifiers": [
                  {
                    "values": [
                      20,
                      22.5,
                      25,
                      27.5,
                      30
                    ],
                    "units": [
                      "%",
                      "%",
                      "%",
                      "%",
                      "%"
                    ]
                  },
                  {
                    "values": [
                      4,
                      4,
                      4,
                      4,
                      4
                    ],
                    "units": [
                      "% per 100 AP",
                      "% per 100 AP",
                      "% per 100 AP",
                      "% per 100 AP",
                      "% per 100 AP"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "Declaring a basic attack or casting an ability will break the camouflage and remove the bonus movement speed, preventing Viego from gaining them again for 1 second, reduced to 0.6 seconds if he recasted Spectral Maw and increased to 2 seconds if he attacked a monster. This duration refreshes on subsequent attacks and ability casts.",
            "leveling": []
          },
          {
            "description": "Harrowed Path can be cast during any of Viego's abilities.",
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": {
          "modifiers": [
            {
              "values": [
                14,
                12,
                10,
                8,
                6
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": true
        },
        "targeting": "Direction",
        "affects": "Self",
        "spellshieldable": null,
        "resource": null,
        "damageType": null,
        "spellEffects": null,
        "projectile": "FALSE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "The bonus movement speed and camouflage are granted by the same buff.\nViego will enter camouflage even while  Recalling.\nViego can cast Harrowed Path during the cast time of any ability or spell.\nRanking up Harrowed Path while the effect is already active will still immediately improve the bonuses it grants.\nHarrowed Path can interact with player-generated terrain.",
        "blurb": "Active:  Viego sends a spectre in the target direction that creates a trail of mist along its path and around the first instance of terrain encountered. While in the mist, Viego gains  camouflaged,  attack speed and  movement speed.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": "none",
        "effectRadius": null,
        "targetRange": null
      }
    ],
    "R": [
      {
        "name": "Heartbreaker",
        "icon": "https://cdn.communitydragon.org/latest/champion/Viego/ability-icon/r",
        "effects": [
          {
            "description": "Active: Viego discards his current possession if he has one and gains displacement immunity over the cast time, then blinks to the target location.",
            "leveling": []
          },
          {
            "description": "Upon arrival, Viego creates a blast that deals 120% AD physical damage to all nearby enemies, increased by 0% − 75% (based on critical strike chance), and knocks back all but one up-to 400 units away based on proximity, though not through terrain.",
            "leveling": []
          },
          {
            "description": "The most wounded enemy champion, alternatively the closest one, is not knocked back and instead takes the blow from Viego's blade, which deals bonus physical damage, slows them by 99% for 0.5 seconds, and applies on-hit effects at 100% effectiveness.",
            "leveling": [
              {
                "attribute": "Bonus Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      15,
                      20,
                      25
                    ],
                    "units": [
                      "%  of target's missing health",
                      "%  of target's missing health",
                      "%  of target's missing health"
                    ]
                  },
                  {
                    "values": [
                      3,
                      3,
                      3
                    ],
                    "units": [
                      "% per 100 bonus AD",
                      "% per 100 bonus AD",
                      "% per 100 bonus AD"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "If a possession is discarded, Heartbreaker will be placed on a 1.5-second cooldown if it is not already on cooldown.",
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": {
          "modifiers": [
            {
              "values": [
                120,
                100,
                80
              ],
              "units": [
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": true
        },
        "targeting": "Location",
        "affects": "Self, Enemies",
        "spellshieldable": "true",
        "resource": null,
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "special",
        "projectile": null,
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Heartbreaker will cast at the edge of its range if the target location is further beyond.\nHeartbreaker will cast at maximum range from the end of  Spectral Maw's dash if it is cast during the dash.\nThe knockback speed is 1000 units per second. The airborne is removed as soon as the displacement ends.\nThe maximum airborne duration is therefore 0.4 seconds. The minimum is 0.1 seconds.\nApplies  spell damage to the struck champion and  area damage to all other enemies.\nViego will enter a 0.25-second cast time if he strikes an enemy champion.\nHeartbreaker's strike to the champion can be  dodged and  blocked, but not  missed.\nViego will be ordered to basic attack the primary target afterwards.",
        "blurb": "Active:  Viego discards his current  possession and  blinks to the target location, attacking the enemy champion in range with the lowest percent health and dealing bonus physical damage based on their  missing health. Other nearby enemies are dealt physical damage and  knocked back.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": "0.5",
        "effectRadius": "300",
        "targetRange": "500"
      }
    ]
  },
  "releaseDate": "2021-01-22",
  "releasePatch": "11.2",
  "patchLastChanged": "11.5",
  "price": {
    "blueEssence": 6300,
    "rp": 975,
    "saleRp": 0
  },
  "lore": "Once ruler of a long-lost kingdom, Viego perished over a thousand years ago when his attempt to bring his wife back from the dead triggered the magical catastrophe known as the Ruination. Transformed into a powerful, unliving wraith tortured by an obsessive longing for his centuries-dead queen, Viego now stands as the Ruined King, controlling the deadly Harrowings as he scours Runeterra for anything that might one day restore her, and destroying all in his path as the Black Mist pours endlessly from his cruel, broken heart.",
  "skins": [
    {
      "name": "Original",
      "id": 234000,
      "isBase": true,
      "availability": "Available",
      "formatName": "Original",
      "lootEligible": true,
      "cost": 975,
      "sale": 0,
      "distribution": null,
      "rarity": "NoRarity",
      "chromas": [],
      "lore": "Once ruler of a long-lost kingdom, Viego perished over a thousand years ago when his attempt to bring his wife back from the dead triggered the magical catastrophe known as the Ruination. Transformed into a powerful, unliving wraith tortured by an obsessive longing for his centuries-dead queen, Viego now stands as the Ruined King, controlling the deadly Harrowings as he scours Runeterra for anything that might one day restore her, and destroying all in his path as the Black Mist pours endlessly from his cruel, broken heart.",
      "release": "2021-01-21",
      "set": [],
      "splashPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-splashes/234/234000.jpg",
      "uncenteredSplashPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-splashes/uncentered/234/234000.jpg",
      "tilePath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-tiles/234/234000.jpg",
      "loadScreenPath": "https://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/assets/characters/viego/skins/base/viegoloadscreen.ruinedking.jpg",
      "loadScreenVintagePath": null,
      "newEffects": false,
      "newAnimations": false,
      "newRecall": false,
      "newVoice": false,
      "newQuotes": false,
      "voiceActor": [
        "Sean Teale"
      ],
      "splashArtist": [
        "Pan Chengwei"
      ]
    },
    {
      "name": "Lunar Beast",
      "id": 234001,
      "isBase": false,
      "availability": "Available",
      "formatName": "Lunar Beast",
      "lootEligible": true,
      "cost": 1350,
      "sale": 0,
      "distribution": null,
      "rarity": "Epic",
      "chromas": [
        {
          "name": "Catseye",
          "id": 234004,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234004.png",
          "colors": [
            "#FFEE59",
            "#FFEE59"
          ],
          "descriptions": [
            {
              "description": null,
              "region": null
            }
          ],
          "rarities": [
            {
              "rarity": null,
              "region": null
            }
          ]
        },
        {
          "name": "Obsidian",
          "id": 234007,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234007.png",
          "colors": [
            "#27211C",
            "#27211C"
          ],
          "descriptions": [
            {
              "description": null,
              "region": null
            }
          ],
          "rarities": [
            {
              "rarity": null,
              "region": null
            }
          ]
        },
        {
          "name": "Rose Quartz",
          "id": 234003,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234003.png",
          "colors": [
            "#E58BA5",
            "#E58BA5"
          ],
          "descriptions": [
            {
              "description": null,
              "region": null
            }
          ],
          "rarities": [
            {
              "rarity": 1,
              "region": "TENCENT"
            }
          ]
        },
        {
          "name": "Ruby",
          "id": 234002,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234002.png",
          "colors": [
            "#D33528",
            "#D33528"
          ],
          "descriptions": [
            {
              "description": "This chroma was released as a bundle exclusive in 2021.",
              "region": "riot"
            }
          ],
          "rarities": [
            {
              "rarity": 1,
              "region": "riot"
            }
          ]
        },
        {
          "name": "Tanzanite",
          "id": 234006,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234006.png",
          "colors": [
            "#54209B",
            "#54209B"
          ],
          "descriptions": [
            {
              "description": null,
              "region": null
            }
          ],
          "rarities": [
            {
              "rarity": null,
              "region": null
            }
          ]
        },
        {
          "name": "Turquoise",
          "id": 234005,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234005.png",
          "colors": [
            "#73BFBE",
            "#73BFBE"
          ],
          "descriptions": [
            {
              "description": null,
              "region": null
            }
          ],
          "rarities": [
            {
              "rarity": null,
              "region": null
            }
          ]
        },
        {
          "name": "Vitality",
          "id": 234008,
          "chromaPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-chroma-images/234/234008.png",
          "colors": [
            "#88FF00",
            "#9B1520"
          ],
          "descriptions": [
            {
              "description": "This chroma was released as a Loot exclusive in the Lunar Beast 2021 event.",
              "region": "riot"
            }
          ],
          "rarities": [
            {
              "rarity": 1,
              "region": "riot"
            }
          ]
        }
      ],
      "lore": "Former leader of a past Lunar Ox Squad, Viego decided that they would fight the Lunar Beast and actually defeat it. His plan ended in tragedy as he watched the rest of his squad be devoured  including his wife. Viego has stewed in bitterness over these losses for years, blaming everyone but himself   including this year's Lunar Ox Squad.",
      "release": "2021-01-21",
      "set": [
        "Lunar Beast"
      ],
      "splashPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-splashes/234/234001.jpg",
      "uncenteredSplashPath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-splashes/uncentered/234/234001.jpg",
      "tilePath": "http://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/v1/champion-tiles/234/234001.jpg",
      "loadScreenPath": "https://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/assets/characters/viego/skins/skin01/viegoloadscreen_1.ruinedking.jpg",
      "loadScreenVintagePath": "https://raw.communitydragon.org/pbe/plugins/rcp-be-lol-game-data/global/default/assets/characters/viego/skins/skin01/viegoloadscreen_1_le.ruinedking.jpg",
      "newEffects": true,
      "newAnimations": true,
      "newRecall": true,
      "newVoice": false,
      "newQuotes": false,
      "voiceActor": [
        "Sean Teale"
      ],
      "splashArtist": [
        "Bo 'chenbowow' Chen"
      ]
    }
  ]
}